In [1]:
import pandas as pd

In [2]:
data = {
    'city':['서울', '경기', '제주', '부산'],
    'total1': [12000, 75000, 63000, 42000],
    'total2': [15000, 18000, 66000, 55000]
}

# 데이터프레임 생성
data_frame = pd.DataFrame(data)
data_frame

  city  total1  total2
0   서울   12000   15000
1   경기   75000   18000
2   제주   63000   66000
3   부산   42000   55000

In [4]:
# 기본 정보 출력
data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   city    4 non-null      object
 1   total1  4 non-null      int64
 2   total2  4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [5]:
data_frame.dtypes

city      object
total1     int64
total2     int64
dtype: object

In [6]:
# city 컬럼 추출
data_frame['city']
data_frame.city

0    서울
1    경기
2    제주
3    부산
Name: city, dtype: object

In [7]:
type(data_frame.city)

pandas.core.series.Series

In [8]:
data_frame.city.dtype

dtype('O')

In [9]:
data_frame.total1.dtype

dtype('int64')

In [12]:
# 컬럼 total2의 값을 오름차순 정렬
data_frame.sort_values('total2')

  city  total1  total2
0   서울   12000   15000
1   경기   75000   18000
3   부산   42000   55000
2   제주   63000   66000

In [13]:
# [문제] 컬럼 total2의 값을 내림차순 정렬, 원본 적용
data_frame.sort_values('total2', ascending=False, inplace=True)
data_frame

  city  total1  total2
2   제주   63000   66000
3   부산   42000   55000
1   경기   75000   18000
0   서울   12000   15000

## 인덱스

In [14]:
# 인덱스 오름차순
data_frame.sort_index()

  city  total1  total2
0   서울   12000   15000
1   경기   75000   18000
2   제주   63000   66000
3   부산   42000   55000

In [15]:
# 인덱스 내림차순
data_frame.sort_index(ascending=False)

  city  total1  total2
3   부산   42000   55000
2   제주   63000   66000
1   경기   75000   18000
0   서울   12000   15000

In [16]:
# 인덱스 재설정
data_frame.reset_index()

   index city  total1  total2
0      2   제주   63000   66000
1      3   부산   42000   55000
2      1   경기   75000   18000
3      0   서울   12000   15000

In [17]:
# 인덱스 재설정, 기존 인덱스 삭제 : 복사본
data_frame.reset_index(drop=True)

  city  total1  total2
0   제주   63000   66000
1   부산   42000   55000
2   경기   75000   18000
3   서울   12000   15000

In [18]:
# 인덱스 재설정, 기존 인덱스 삭제 : 원본 적용
data_frame.reset_index(drop=True, inplace=True)
data_frame

  city  total1  total2
0   제주   63000   66000
1   부산   42000   55000
2   경기   75000   18000
3   서울   12000   15000

## 컬럼

In [19]:
# 컬럼
# 열의 인덱스
data_frame.columns

Index(['city', 'total1', 'total2'], dtype='object')

In [20]:
data_frame[:1]

  city  total1  total2
0   제주   63000   66000

In [21]:
# 컬럼명 변경(일부), 원본 적용
# total1 -> 총합1
data_frame.rename(columns={'total1':'총합1'}, inplace=True)
data_frame

  city    총합1  total2
0   제주  63000   66000
1   부산  42000   55000
2   경기  75000   18000
3   서울  12000   15000

## 조건에 맞는 데이터 추출

In [24]:
# 조건에 맞는 데이터 추출
# 1) 지역이 서울인 데이터만 추출
data_frame.loc[data_frame.city == '서울']
data_frame[data_frame.city == '서울']

  city    총합1  total2
3   서울  12000   15000

In [32]:
# 총합1의 값이 50,000 이상인 데이터 추출
data_frame[data_frame.총합1 >= 50000]

  city    총합1  total2
0   제주  63000   66000
2   경기  75000   18000

In [34]:
# 총합1과 total2 모두 50,000 이상인 데이터 추출
data_frame[(data_frame.총합1 >= 50000) & (data_frame.total2 >= 50000)]

  city    총합1  total2
0   제주  63000   66000

In [37]:
# city에서 산이 포함된 데이터 추출
data_frame[data_frame.city.str.contains('산')]

  city    총합1  total2
1   부산  42000   55000